In [1]:
import pandas as pd
exam = pd.read_csv('exam.csv')
exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [2]:
exam.query('nclass == 1') # nclass 가 1인 행만 출력

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [3]:
exam.query('nclass == 2')

   id  nclass  math  english  science
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25

In [4]:
exam.query('nclass != 1') # nclass 가 1이 아닌 행 출력

    id  nclass  math  english  science
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [5]:
exam.query('nclass != 3')

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [6]:
exam.query('math > 50') # math 가 50 보다 큰 행만 출력

    id  nclass  math  english  science
1    2       1    60       97       60
6    7       2    80       90       45
7    8       2    90       78       25
10  11       3    65       65       65
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [7]:
exam.query('math < 50')

    id  nclass  math  english  science
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
8    9       3    20       98       15
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12

In [8]:
exam.query('english >= 50')

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [9]:
exam.query('english <= 80')

    id  nclass  math  english  science
4    5       2    25       80       65
7    8       2    90       78       25
10  11       3    65       65       65
14  15       4    75       56       78
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87

In [10]:
exam.query('nclass == 1 & math >= 50') # nclass가 1과 같고 math가 50보다 크거나 같음

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60

In [11]:
exam.query('nclass == 2 & english >=  80')

   id  nclass  math  english  science
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45

In [12]:
exam.query('math >= 90 | english >= 90') # math가 90보다 크거나 english가 90보다 큼

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
3    4       1    30       98       58
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
12  13       4    46       98       65
15  16       4    58       98       65

In [13]:
exam.query('english < 90 | science < 50')

    id  nclass  math  english  science
2    3       1    45       86       78
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
13  14       4    48       87       12
14  15       4    75       56       78
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [14]:
exam.query('nclass == 1 | nclass == 3 | nclass == 5') # 1, 3, 5 중 하나라도 참이면 출력

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [15]:
exam.query('nclass in [1, 3, 5]') # 목록에 해당하는 행 추출

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [16]:
nclass1 = exam.query('nclass == 1') # 추출한 행으로 데이터 생성
nclass2 = exam.query('nclass == 2')

nclass1 # 데이터 출력
nclass2

   id  nclass  math  english  science
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25

In [17]:
nclass1['math'].mean() # 1반의 수학 점수 평균

46.25

In [18]:
nclass2['math'].mean()

61.25

In [19]:
df = pd.DataFrame(
    {'sex' : ['F', 'M', 'F', 'M'],
     'country' : ['Korea', 'China', 'Japan', 'USA']
    }
)
df # 문자 변수를 이용해 '전체 조건'과 '추출할 문자'에 해당하는 값 추출

  sex country
0   F   Korea
1   M   China
2   F   Japan
3   M     USA

In [20]:
df.query('sex == "F" & country == "Korea"') ## 전체 조건과 추출한 문자의 따옴표는 달라야 함
df.query("sex == 'M' & country == 'China'")

# df.query('sex == 'F'' & country == 'Korea'') 같으면 에러남

  sex country
1   M   China

In [21]:
var = 3
exam.query('nclass == @var') # 외부 변수를 이용해 조건에 맞는 행 추출

    id  nclass  math  english  science
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32

In [22]:
pd.set_option('display.max_rows', None) # 모든 행 출력하도록 설정
pd.set_option('display.max_columns',None) # 모든 열 출력 "

pd.reset_option('display.max_rows') # 설정 리셋
pd.reset_option('display.max_columns')

pd.reset_option('all') #모든 설정 리셋

C:\Users\jcj15\AppData\Local\Temp\ipykernel_11876\3185807919.py:7: FutureWarning: use_inf_as_na option is deprecated and will be removed in a future version. Convert inf values to NaN before operating instead.
  pd.reset_option('all') #모든 설정 리셋

In [23]:
mpg = pd.read_csv('mpg.csv') # 6장 첫 번째 혼자서 해보기
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [24]:
mpg_displ1 = mpg.query('displ <= 4') # Q1
mpg_displ1['hwy'].mean()

25.96319018404908

In [25]:
mpg_displ2 = mpg.query('displ >= 5')
mpg_displ2['hwy'].mean()

18.07894736842105

In [26]:
mpg_audi = mpg.query("manufacturer == 'audi'") # Q2
mpg_audi['cty'].mean()

17.61111111111111

In [27]:
mpg_toyota = mpg.query("manufacturer == 'toyota'")
mpg_toyota['cty'].mean()

18.529411764705884

In [28]:
mpg_manu = mpg.query("manufacturer in ['chevrolet', 'ford', 'honda']") # Q3
mpg_manu['hwy'].mean()

22.50943396226415

In [29]:
exam['math'] # 필요한 행만 추출

0     50
1     60
2     45
3     30
4     25
5     50
6     80
7     90
8     20
9     50
10    65
11    45
12    46
13    48
14    75
15    58
16    65
17    80
18    89
19    78
Name: math, dtype: int64

In [30]:
exam[['nclass', 'math', 'english']] # 여러 변수 추출

    nclass  math  english
0        1    50       98
1        1    60       97
2        1    45       86
3        1    30       98
4        2    25       80
5        2    50       89
6        2    80       90
7        2    90       78
8        3    20       98
9        3    50       98
10       3    65       65
11       3    45       85
12       4    46       98
13       4    48       87
14       4    75       56
15       4    58       98
16       5    65       68
17       5    80       78
18       5    89       68
19       5    78       83

In [31]:
exam['math'] # 값만 출력 (시리즈)
exam[['math']] # 대괄호를 두번 쓰면 행이름 유지 (데이터 프레임)

    math
0     50
1     60
2     45
3     30
4     25
5     50
6     80
7     90
8     20
9     50
10    65
11    45
12    46
13    48
14    75
15    58
16    65
17    80
18    89
19    78

In [32]:
exam.drop(columns='math') # 변수 제거
exam_d = exam.drop(columns='math') # 제거된 프레임을 변수로 지정해야 완전히 삭제됨

In [33]:
exam.drop(columns = ['math', 'english'])

    id  nclass  science
0    1       1       50
1    2       1       60
2    3       1       78
3    4       1       58
4    5       2       65
5    6       2       98
6    7       2       45
7    8       2       25
8    9       3       15
9   10       3       45
10  11       3       65
11  12       3       32
12  13       4       65
13  14       4       12
14  15       4       78
15  16       4       65
16  17       5       98
17  18       5       90
18  19       5       87
19  20       5       58

In [71]:
exam.query('nclass == 1')[['english']] # nclass가 1인 행만 추출 후 english 추출

   english
0       98
1       97
2       86
3       98

In [35]:
exam.query('math >= 50')[['id', 'math']] # math가 50 이상인 id, math 추출

    id  math
0    1    50
1    2    60
5    6    50
6    7    80
7    8    90
9   10    50
10  11    65
14  15    75
15  16    58
16  17    65
17  18    80
18  19    89
19  20    78

In [36]:
exam.query('math >= 50')[['id', 'math']].head() # 앞부분 5열(기본값)만 출력

   id  math
0   1    50
1   2    60
5   6    50
6   7    80
7   8    90

In [37]:
exam.query('math >= 50')[['id', 'math']].head(10) # 앞부분 10열만 출력

    id  math
0    1    50
1    2    60
5    6    50
6    7    80
7    8    90
9   10    50
10  11    65
14  15    75
15  16    58
16  17    65

In [38]:
## 명령어 뒤에 '\' 입력 후 엔터로 줄바꿈 - 가독성 증가

In [39]:
# 두 번째 혼자서 해보기 Q1
mpg[['category', 'cty']] 
mpg_cc = mpg[['category', 'cty']] 

mpg_cc.head()

  category  cty
0  compact   18
1  compact   21
2  compact   20
3  compact   21
4  compact   16

In [40]:
# Q2
mpg_cc.query("category == 'suv'")['cty'].mean() # 13.5
mpg_cc.query("category == 'compact'")['cty'].mean() # 20.1

20.127659574468087

In [41]:
exam.sort_values('math') # 오름차순 정렬
# exam.sort_values('math')[['math']]

    id  nclass  math  english  science
8    9       3    20       98       15
4    5       2    25       80       65
3    4       1    30       98       58
2    3       1    45       86       78
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
0    1       1    50       98       50
9   10       3    50       98       45
5    6       2    50       89       98
15  16       4    58       98       65
1    2       1    60       97       60
10  11       3    65       65       65
16  17       5    65       68       98
14  15       4    75       56       78
19  20       5    78       83       58
6    7       2    80       90       45
17  18       5    80       78       90
18  19       5    89       68       87
7    8       2    90       78       25

In [42]:
exam.sort_values('math', ascending = False) # 내림차순

    id  nclass  math  english  science
7    8       2    90       78       25
18  19       5    89       68       87
17  18       5    80       78       90
6    7       2    80       90       45
19  20       5    78       83       58
14  15       4    75       56       78
16  17       5    65       68       98
10  11       3    65       65       65
1    2       1    60       97       60
15  16       4    58       98       65
9   10       3    50       98       45
5    6       2    50       89       98
0    1       1    50       98       50
13  14       4    48       87       12
12  13       4    46       98       65
11  12       3    45       85       32
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
8    9       3    20       98       15

In [43]:
exam.sort_values(['nclass', 'math']) # 순서대로 정렬

    id  nclass  math  english  science
3    4       1    30       98       58
2    3       1    45       86       78
0    1       1    50       98       50
1    2       1    60       97       60
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
11  12       3    45       85       32
9   10       3    50       98       45
10  11       3    65       65       65
12  13       4    46       98       65
13  14       4    48       87       12
15  16       4    58       98       65
14  15       4    75       56       78
16  17       5    65       68       98
19  20       5    78       83       58
17  18       5    80       78       90
18  19       5    89       68       87

In [44]:
exam.sort_values(['nclass', 'math'], ascending = [True, False]) # 행 각각 다르게 정렬

    id  nclass  math  english  science
1    2       1    60       97       60
0    1       1    50       98       50
2    3       1    45       86       78
3    4       1    30       98       58
7    8       2    90       78       25
6    7       2    80       90       45
5    6       2    50       89       98
4    5       2    25       80       65
10  11       3    65       65       65
9   10       3    50       98       45
11  12       3    45       85       32
8    9       3    20       98       15
14  15       4    75       56       78
15  16       4    58       98       65
13  14       4    48       87       12
12  13       4    46       98       65
18  19       5    89       68       87
17  18       5    80       78       90
19  20       5    78       83       58
16  17       5    65       68       98

In [45]:
exam.assign(total = exam['math'] + exam['english'] + exam['science']) # 파생변수 추가

    id  nclass  math  english  science  total
0    1       1    50       98       50    198
1    2       1    60       97       60    217
2    3       1    45       86       78    209
3    4       1    30       98       58    186
4    5       2    25       80       65    170
5    6       2    50       89       98    237
6    7       2    80       90       45    215
7    8       2    90       78       25    193
8    9       3    20       98       15    133
9   10       3    50       98       45    193
10  11       3    65       65       65    195
11  12       3    45       85       32    162
12  13       4    46       98       65    209
13  14       4    48       87       12    147
14  15       4    75       56       78    209
15  16       4    58       98       65    221
16  17       5    65       68       98    231
17  18       5    80       78       90    248
18  19       5    89       68       87    244
19  20       5    78       83       58    219

In [46]:
exam.assign(
    # 합계
    total = exam['math'] + exam['english'] + exam['science'],
    # 평균
    mean = (exam['math'] + exam['english'] + exam['science']) / 3 
) #  여러개 추가

## drop과 마찬가지로 변수로 따로 선언해야 저장됨

    id  nclass  math  english  science  total       mean
0    1       1    50       98       50    198  66.000000
1    2       1    60       97       60    217  72.333333
2    3       1    45       86       78    209  69.666667
3    4       1    30       98       58    186  62.000000
4    5       2    25       80       65    170  56.666667
5    6       2    50       89       98    237  79.000000
6    7       2    80       90       45    215  71.666667
7    8       2    90       78       25    193  64.333333
8    9       3    20       98       15    133  44.333333
9   10       3    50       98       45    193  64.333333
10  11       3    65       65       65    195  65.000000
11  12       3    45       85       32    162  54.000000
12  13       4    46       98       65    209  69.666667
13  14       4    48       87       12    147  49.000000
14  15       4    75       56       78    209  69.666667
15  16       4    58       98       65    221  73.666667
16  17       5    65       68       98    231  77.000000
17  18       5    80       78       90    248  82.666667
18  19       5    89       68       87    244  81.333333
19  20       5    78       83       58    219  73.000000

In [47]:
import numpy as np

exam.assign(test = np.where(exam['science'] >= 60, 'pass', 'fall')) # 조건이 참일 경우 pass 거짓일 경우 fall 출력

    id  nclass  math  english  science  test
0    1       1    50       98       50  fall
1    2       1    60       97       60  pass
2    3       1    45       86       78  pass
3    4       1    30       98       58  fall
4    5       2    25       80       65  pass
5    6       2    50       89       98  pass
6    7       2    80       90       45  fall
7    8       2    90       78       25  fall
8    9       3    20       98       15  fall
9   10       3    50       98       45  fall
10  11       3    65       65       65  pass
11  12       3    45       85       32  fall
12  13       4    46       98       65  pass
13  14       4    48       87       12  fall
14  15       4    75       56       78  pass
15  16       4    58       98       65  pass
16  17       5    65       68       98  pass
17  18       5    80       78       90  pass
18  19       5    89       68       87  pass
19  20       5    78       83       58  fall

In [48]:
exam.assign(total = exam['math'] + exam['english'] + exam['science'])\
    .sort_values('total', ascending = False) # 추가한 변수에 pandas 함수 활용

    id  nclass  math  english  science  total
17  18       5    80       78       90    248
18  19       5    89       68       87    244
5    6       2    50       89       98    237
16  17       5    65       68       98    231
15  16       4    58       98       65    221
19  20       5    78       83       58    219
1    2       1    60       97       60    217
6    7       2    80       90       45    215
12  13       4    46       98       65    209
2    3       1    45       86       78    209
14  15       4    75       56       78    209
0    1       1    50       98       50    198
10  11       3    65       65       65    195
9   10       3    50       98       45    193
7    8       2    90       78       25    193
3    4       1    30       98       58    186
4    5       2    25       80       65    170
11  12       3    45       85       32    162
13  14       4    48       87       12    147
8    9       3    20       98       15    133

In [49]:
# lambda 를 이용해 데이터 프레임명 줄이기
long_name = pd.read_csv('exam.csv')

long_name.assign(new = long_name['math'] + long_name['english'] + long_name['science'])

long_name.assign(new = lambda x: x['math'] + x['english'] + x['science']) 

# long_name 을 x로 치환

    id  nclass  math  english  science  new
0    1       1    50       98       50  198
1    2       1    60       97       60  217
2    3       1    45       86       78  209
3    4       1    30       98       58  186
4    5       2    25       80       65  170
5    6       2    50       89       98  237
6    7       2    80       90       45  215
7    8       2    90       78       25  193
8    9       3    20       98       15  133
9   10       3    50       98       45  193
10  11       3    65       65       65  195
11  12       3    45       85       32  162
12  13       4    46       98       65  209
13  14       4    48       87       12  147
14  15       4    75       56       78  209
15  16       4    58       98       65  221
16  17       5    65       68       98  231
17  18       5    80       78       90  248
18  19       5    89       68       87  244
19  20       5    78       83       58  219

In [50]:
# 혼자서 해보기 세 번째 Q1
mpg_new = mpg.copy()
mpg_new = mpg_new.assign(CH = mpg_new['cty'] + mpg_new['hwy'])

In [51]:
# Q2
mpg_new = mpg_new.assign(CHmean = mpg_new['CH'] / 2)

In [52]:
# Q3
mpg_new.sort_values('CHmean', ascending=False).head(3)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,CH,CHmean
221,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,79,39.5
212,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,77,38.5
222,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,70,35.0

In [53]:
# Q4
mpg.assign(total = lambda x: x['cty'] + x['hwy'],
    mean = lambda x: x['total'] / 2)\
    .sort_values('mean', ascending=False)\
    .head(3)
    
# 1, 2, 3 구문 연결

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total,mean
221,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,79,39.5
212,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,77,38.5
222,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,70,35.0

In [54]:
exam.agg(mean_math = ('math', 'mean')) # 행의 평균 추출

            math
mean_math  57.45

In [55]:
exam.groupby('nclass')\
    .agg(mean_math = ('math', 'mean') # groupby로 nclass 그룹화 후 agg함수로 math 평균 추출
)

        mean_math
nclass
1           46.25
2           61.25
3           45.00
4           56.75
5           78.00

In [56]:
##################### CHAPTER 06 - 두 번째 강의 ##################### 

exam.agg(mean_math = ('math', 'mean'))

            math
mean_math  57.45

In [57]:
exam.groupby('nclass')\
    .agg(mean_math=('math', 'mean'))

        mean_math
nclass
1           46.25
2           61.25
3           45.00
4           56.75
5           78.00

In [58]:
exam.groupby('nclass')\
    .agg(mean_math = ('math', 'mean'),
         sum_math = ('math', 'sum'),
         median_math = ('math', 'median'),
         n = ('nclass', 'count'))

        mean_math  sum_math  median_math  n
nclass
1           46.25       185         47.5  4
2           61.25       245         65.0  4
3           45.00       180         47.5  4
4           56.75       227         53.0  4
5           78.00       312         79.0  4

In [59]:
mpg.groupby(['manufacturer', 'drv'])\
   .agg (mean_cty = ('cty', 'mean'))

                   mean_cty
manufacturer drv
audi         4    16.818182
             f    18.857143
chevrolet    4    12.500000
             f    18.800000
             r    14.100000
dodge        4    12.000000
             f    15.818182
ford         4    13.307692
             r    14.750000
honda        f    24.444444
hyundai      f    18.642857
jeep         4    13.500000
land rover   4    11.500000
lincoln      r    11.333333
mercury      4    13.250000
nissan       4    13.750000
             f    20.000000
pontiac      f    17.000000
subaru       4    19.285714
toyota       4    14.933333
             f    21.368421
volkswagen   f    20.925926

In [60]:
mpg.query('category == "suv"')\
    .assign(total = (mpg['hwy'] + mpg['cty']) / 2)\
    .groupby('manufacturer')\
    .agg(mean_tot = ('total', 'mean'))\
    .sort_values('mean_tot', ascending = False)\
    .head()

               mean_tot
manufacturer
subaru        21.916667
toyota        16.312500
nissan        15.875000
mercury       15.625000
jeep          15.562500

In [61]:
# 첫 번째 혼자서 해보기 
# Q1
mpg = pd.read_csv('mpg.csv')

mpg.groupby('category')\
    .agg(mean_cty = ('cty', 'mean'))

             mean_cty
category
2seater     15.400000
compact     20.127660
midsize     18.756098
minivan     15.818182
pickup      13.000000
subcompact  20.371429
suv         13.500000

In [62]:
# Q2
mpg.groupby('category')\
    .agg(mean_cty = ('cty', 'mean'))\
    .sort_values('mean_cty', ascending=False)

             mean_cty
category
subcompact  20.371429
compact     20.127660
midsize     18.756098
minivan     15.818182
2seater     15.400000
suv         13.500000
pickup      13.000000

In [63]:
# Q3
mpg.groupby('manufacturer')\
    .agg(mean_hwy = ('hwy', 'mean'))\
    .sort_values('mean_hwy', ascending=False)\
    .head(3)

               mean_hwy
manufacturer
honda         32.555556
volkswagen    29.222222
hyundai       26.857143

In [64]:
# Q4-1
# groupby 한 다음 sort_values 로 정렬
mpg.query('category == "compact"')\
    .groupby('manufacturer')\
    .agg(n = ('manufacturer', 'count'))\
    .sort_values('n', ascending=False)

               n
manufacturer
audi          15
volkswagen    14
toyota        12
subaru         4
nissan         2

In [65]:
# Q4-2
# groupby 하지 않고 value_counts 로 바로 내림차순 정렬
mpg.query('category == "compact"')\
    .value_counts('manufacturer')

manufacturer
audi          15
volkswagen    14
toyota        12
subaru         4
nissan         2
Name: count, dtype: int64

In [66]:
test1 = pd.DataFrame({'id' : [1,2,3,4,5],
                      'midterm' : [60,70,80,90,100]})

test2 = pd.DataFrame({'id' : [1,2,3,4,5],
                      'final' : [60,70,80,90,100]})

test1
test2

   id  final
0   1     60
1   2     70
2   3     80
3   4     90
4   5    100

In [67]:
# test1, test2를 '가로'로 데이터프레임 합치기
total = pd.merge(test1, test2, how = 'left', on = 'id') 
total

   id  midterm  final
0   1       60     60
1   2       70     70
2   3       80     80
3   4       90     90
4   5      100    100

In [68]:
group_a = pd.DataFrame({'id' : [1,2,3,4,5],
                      'test' : [60,70,80,90,100]})

group_b = pd.DataFrame({'id' : [1,2,3,4,5],
                      'test' : [60,70,80,90,100]})

group_a
group_b

   id  test
0   1    60
1   2    70
2   3    80
3   4    90
4   5   100

In [69]:
# '세로'로 데이터프레임 합치기
group_all = pd.concat([group_a, group_b], ignore_index=True)  # 인덱스 중복 방지 파라미터
group_all

   id  test
0   1    60
1   2    70
2   3    80
3   4    90
4   5   100
5   1    60
6   2    70
7   3    80
8   4    90
9   5   100

In [70]:
# 두 번째 혼자서 해보기
## Chapter 6장 pdf 마지막에 3~6장 요약본 있음
### 6장에서 2~3 문제 (비중 큼), 7장에서 1문제